Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_b_i2c.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// eusci_b_i2c.c - Driver for the eusci_b_i2c Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup eusci_b_i2c_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_EUSCI_Bx__
#include "eusci_b_i2c.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the I2C Master block.
//!
//! This function initializes operation of the I2C Master block. Upon
//! successful initialization of the I2C block, this function will have set the
//! bus speed for the master; however I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param selectClockSource is the clocksource.
//!        Valid values are:
//!        - \b EUSCI_B_I2C_CLOCKSOURCE_ACLK
//!        - \b EUSCI_B_I2C_CLOCKSOURCE_SMCLK
//! \param i2cClk is the rate of the clock supplied to the I2C module (the
//!        frequency in Hz of the clock source specified in selectClockSource).
//! \param dataRate setup for selecting data transfer rate.
//!        Valid values are:
//!        - \b EUSCI_B_I2C_SET_DATA_RATE_400KBPS
//!        - \b EUSCI_B_I2C_SET_DATA_RATE_100KBPS
//! \param byteCounterThreshold sets threshold for automatic STOP or UCSTPIFG
//! \param autoSTOPGeneration sets up the STOP condition generation.
//!        Valid values are:
//!        - \b EUSCI_B_I2C_NO_AUTO_STOP
//!        - \b EUSCI_B_I2C_SET_BYTECOUNT_THRESHOLD_FLAG
//!        - \b EUSCI_B_I2C_SEND_STOP_AUTOMATICALLY_ON_BYTECOUNT_THRESHOLD
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_masterInit(uint16_t baseAddress,
                            uint8_t selectClockSource,
                            uint32_t i2cClk,
                            uint32_t dataRate,
                            uint8_t byteCounterThreshold,
                            uint8_t autoSTOPGeneration
                            )
{
        EUSCI_B_I2C_initMasterParam param = { 0 };

        param.selectClockSource = selectClockSource;
        param.i2cClk = i2cClk;
        param.dataRate = dataRate;
        param.byteCounterThreshold = byteCounterThreshold;
        param.autoSTOPGeneration = autoSTOPGeneration;

        EUSCI_B_I2C_initMaster(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the I2C Master block.
//!
//! This function initializes operation of the I2C Master block. Upon
//! successful initialization of the I2C block, this function will have set the
//! bus speed for the master; however I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param param is the pointer to the struct for master initialization.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_initMaster(uint16_t baseAddress,
                            EUSCI_B_I2C_initMasterParam *param
                            )
{
        uint16_t preScalarValue;

        assert(param != 0);

        assert((EUSCI_B_I2C_CLOCKSOURCE_ACLK == param->selectClockSource) ||
               (EUSCI_B_I2C_CLOCKSOURCE_SMCLK == param->selectClockSource)
               );

        assert((EUSCI_B_I2C_SET_DATA_RATE_400KBPS == param->dataRate) ||
               (EUSCI_B_I2C_SET_DATA_RATE_100KBPS == param->dataRate)
               );

        assert((EUSCI_B_I2C_NO_AUTO_STOP == param->autoSTOPGeneration) ||
               (EUSCI_B_I2C_SET_BYTECOUNT_THRESHOLD_FLAG == param->autoSTOPGeneration) ||
               (EUSCI_B_I2C_SEND_STOP_AUTOMATICALLY_ON_BYTECOUNT_THRESHOLD == param->autoSTOPGeneration)
               );

        //Disable the USCI module and clears the other bits of control register
        HWREG16(baseAddress + OFS_UCBxCTLW0) = UCSWRST;

