Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_b_i2c.c
        //Configure Automatic STOP condition generation
        HWREG16(baseAddress + OFS_UCBxCTLW1) &= ~UCASTP_3;
        HWREG16(baseAddress + OFS_UCBxCTLW1) |= param->autoSTOPGeneration;

        //Byte Count Threshold
        HWREG16(baseAddress + OFS_UCBxTBCNT) = param->byteCounterThreshold;
        /*
         * Configure as I2C master mode.
         * UCMST = Master mode
         * UCMODE_3 = I2C mode
         * UCSYNC = Synchronous mode
         */
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCMST + UCMODE_3 + UCSYNC;

        //Configure I2C clock source
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= (param->selectClockSource + UCSWRST);

        /*
         * Compute the clock divider that achieves the fastest speed less than or
         * equal to the desired speed.  The numerator is biased to favor a larger
         * clock divider so that the resulting clock is always less than or equal
         * to the desired clock, never greater.
         */
        preScalarValue = (uint16_t)(param->i2cClk / param->dataRate);
        HWREG16(baseAddress + OFS_UCBxBRW) = preScalarValue;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the I2C Slave block.
//!
//! This function initializes operation of the I2C as a Slave mode. Upon
//! successful initialization of the I2C blocks, this function will have set
//! the slave address but the I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked.
//!
//! \param baseAddress is the base address of the I2C Slave module.
//! \param slaveAddress 7-bit slave address
//! \param slaveAddressOffset Own address Offset referred to- 'x' value of
//!        UCBxI2COAx.
//!        Valid values are:
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_OFFSET0
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_OFFSET1
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_OFFSET2
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_OFFSET3
//! \param slaveOwnAddressEnable selects if the specified address is enabled or
//!        disabled.
//!        Valid values are:
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_DISABLE
//!        - \b EUSCI_B_I2C_OWN_ADDRESS_ENABLE
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_slaveInit(uint16_t baseAddress,
                           uint8_t slaveAddress,
                           uint8_t slaveAddressOffset,
                           uint32_t slaveOwnAddressEnable
                           )
{
        EUSCI_B_I2C_initSlaveParam param = { 0 };

        param.slaveAddress = slaveAddress;
        param.slaveAddressOffset = slaveAddressOffset;
        param.slaveOwnAddressEnable = slaveOwnAddressEnable;

        EUSCI_B_I2C_initSlave(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the I2C Slave block.
//!
//! This function initializes operation of the I2C as a Slave mode. Upon
//! successful initialization of the I2C blocks, this function will have set
//! the slave address but the I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked.
//!
//! \param baseAddress is the base address of the I2C Slave module.
//! \param param is the pointer to the struct for slave initialization.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_initSlave(uint16_t baseAddress,
                           EUSCI_B_I2C_initSlaveParam *param
                           )
{
        assert(param != 0);

        assert((EUSCI_B_I2C_OWN_ADDRESS_OFFSET0 == param->slaveAddressOffset) ||
               (EUSCI_B_I2C_OWN_ADDRESS_OFFSET1 == param->slaveAddressOffset) ||
               (EUSCI_B_I2C_OWN_ADDRESS_OFFSET2 == param->slaveAddressOffset) ||
               (EUSCI_B_I2C_OWN_ADDRESS_OFFSET3 == param->slaveAddressOffset)
               );

        //Disable the USCI module
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCSWRST;

        //Clear USCI master mode
        HWREG16(baseAddress + OFS_UCBxCTLW0) &= ~UCMST;

        //Configure I2C as Slave and Synchronous mode
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCMODE_3 + UCSYNC;

        //Set up the slave address.
        HWREG16(baseAddress + OFS_UCBxI2COA0 + param->slaveAddressOffset)
                = param->slaveAddress + param->slaveOwnAddressEnable;
}
//*****************************************************************************
//
//! \brief Enables the I2C block.
//!
//! This will enable operation of the I2C block.
//!
//! \param baseAddress is the base address of the USCI I2C module.
//!
//! Modified bits are \b UCSWRST of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_enable(uint16_t baseAddress)
{
        //Reset the UCSWRST bit to enable the USCI Module
        HWREG16(baseAddress + OFS_UCBxCTLW0) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! \brief Disables the I2C block.
//!
//! This will disable operation of the I2C block.
//!
//! \param baseAddress is the base address of the USCI I2C module.
//!
//! Modified bits are \b UCSWRST of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_disable(uint16_t baseAddress)
{
        //Set the UCSWRST bit to disable the USCI Module
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCSWRST;
}

//*****************************************************************************
//
//! \brief Sets the address that the I2C Master will place on the bus.
//!
//! This function will set the address that the I2C Master will place on the
//! bus when initiating a transaction.
//!
//! \param baseAddress is the base address of the USCI I2C module.
//! \param slaveAddress 7-bit slave address
//!
//! Modified bits of \b UCBxI2CSA register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_setSlaveAddress(uint16_t baseAddress,
                                 uint8_t slaveAddress
                                 )
{
        //Set the address of the slave with which the master will communicate.
        HWREG16(baseAddress + OFS_UCBxI2CSA) = (slaveAddress);
}

//*****************************************************************************
//
//! \brief Sets the mode of the I2C device
//!
//! When the receive parameter is set to EUSCI_B_I2C_TRANSMIT_MODE, the address
//! will indicate that the I2C module is in receive mode; otherwise, the I2C
//! module is in send mode.
//!
//! \param baseAddress is the base address of the USCI I2C module.
//! \param mode Mode for the EUSCI_B_I2C module
//!        Valid values are:
//!        - \b EUSCI_B_I2C_TRANSMIT_MODE [Default]
//!        - \b EUSCI_B_I2C_RECEIVE_MODE
//!
//! Modified bits are \b UCTR of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_setMode(uint16_t baseAddress,
                         uint8_t mode
                         )
{
        assert((EUSCI_B_I2C_TRANSMIT_MODE == mode) ||
               (EUSCI_B_I2C_RECEIVE_MODE == mode)
               );

        HWREG16(baseAddress + OFS_UCBxCTLW0) &= ~EUSCI_B_I2C_TRANSMIT_MODE;
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= mode;
}

//*****************************************************************************
//
//! \brief Gets the mode of the I2C device
//!
//! Current I2C transmit/receive mode.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! Modified bits are \b UCTR of \b UCBxCTLW0 register.
//!
//! \return None
//!         Return one of the following:
//!         - \b EUSCI_B_I2C_TRANSMIT_MODE
//!         - \b EUSCI_B_I2C_RECEIVE_MODE
//!         \n indicating the current mode
//
//*****************************************************************************
uint8_t EUSCI_B_I2C_getMode(uint16_t baseAddress)
{
        //Read the I2C mode.
        return (HWREG16(baseAddress + OFS_UCBxCTLW0) & UCTR);

