Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/eusci_b_i2c.c
        //Wait for Stop to finish
        while (HWREG16(baseAddress + OFS_UCBxCTLW0) & UCTXSTP)

                // Wait for RX buffer
                while (!(HWREG16(baseAddress + OFS_UCBxIFG) & UCRXIFG)) ;

        //Capture data from receive buffer after setting stop bit due to
        //MSP430 I2C critical timing.
        return HWREG16(baseAddress + OFS_UCBxRXBUF);
}

//*****************************************************************************
//
//! \brief Finishes multi-byte reception at the Master end with timeout
//!
//! This function is used by the Master module to initiate completion of a
//! multi-byte reception. This function receives the current byte and initiates
//! the STOP from master to slave.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param txData is a pointer to the location to store the received byte at
//!        master end
//! \param timeout is the amount of time to wait until giving up
//!
//! Modified bits are \b UCTXSTP of \b UCBxCTLW0 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the reception process
//
//*****************************************************************************
bool EUSCI_B_I2C_masterMultiByteReceiveFinishWithTimeout(uint16_t baseAddress,
                                                         uint8_t *txData,
                                                         uint32_t timeout
                                                         )
{
        assert(timeout > 0);

        uint32_t timeout2 = timeout;

        //Send stop condition.
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCTXSTP;

        //Wait for Stop to finish
        while ((HWREG16(baseAddress + OFS_UCBxCTLW0) & UCTXSTP) && --timeout) ;

        //Check if transfer timed out
        if (timeout == 0)
                return STATUS_FAIL;

        // Wait for RX buffer
        while ((!(HWREG16(baseAddress + OFS_UCBxIFG) & UCRXIFG)) && --timeout2) ;

        //Check if transfer timed out
        if (timeout2 == 0)
                return STATUS_FAIL;

        //Capture data from receive buffer after setting stop bit due to
        //MSP430 I2C critical timing.
        *txData = (HWREG8(baseAddress + OFS_UCBxRXBUF));

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Sends the STOP at the end of a multi-byte reception at the Master
//! end
//!
//! This function is used by the Master module to initiate STOP
//!
//! \param baseAddress is the base address of the I2C Master module.
//!
//! Modified bits are \b UCTXSTP of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_masterMultiByteReceiveStop(uint16_t baseAddress)
{
        //Send stop condition.
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCTXSTP;
}

//*****************************************************************************
//
//! \brief Enables Multi Master Mode
//!
//! At the end of this function, the I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! Modified bits are \b UCSWRST and \b UCMM of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_enableMultiMasterMode(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCSWRST;
        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCMM;
}

//*****************************************************************************
//
//! \brief Disables Multi Master Mode
//!
//! At the end of this function, the I2C module is still disabled till
//! EUSCI_B_I2C_enable is invoked
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! Modified bits are \b UCSWRST and \b UCMM of \b UCBxCTLW0 register.
//!
//! \return None
//
//*****************************************************************************
void EUSCI_B_I2C_disableMultiMasterMode(uint16_t baseAddress)
{

        HWREG16(baseAddress + OFS_UCBxCTLW0) |= UCSWRST;
        HWREG16(baseAddress + OFS_UCBxCTLW0) &= ~UCMM;
}

//*****************************************************************************
//
//! \brief receives a byte that has been sent to the I2C Master Module.
//!
//! This function reads a byte of data from the I2C receive data Register.
//!
//! \param baseAddress is the base address of the I2C Master module.
//!
//! \return Returns the byte received from by the I2C module, cast as an
//!         uint8_t.
//
//*****************************************************************************
uint8_t EUSCI_B_I2C_masterSingleReceive(uint16_t baseAddress)
{
        //Polling RXIFG0 if RXIE is not enabled
        if (!(HWREG16(baseAddress + OFS_UCBxIE) & UCRXIE0))
                while (!(HWREG16(baseAddress + OFS_UCBxIFG) & UCRXIFG0)) ;

        //Read a byte.
        return HWREG16(baseAddress + OFS_UCBxRXBUF);
}

//*****************************************************************************
//
//! \brief Returns the address of the RX Buffer of the I2C for the DMA module.
//!
//! Returns the address of the I2C RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! \return The address of the I2C RX Buffer
//
//*****************************************************************************
uint32_t EUSCI_B_I2C_getReceiveBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCBxRXBUF;
}

//*****************************************************************************
//
//! \brief Returns the address of the TX Buffer of the I2C for the DMA module.
//!
//! Returns the address of the I2C TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \param baseAddress is the base address of the I2C module.
//!
//! \return The address of the I2C TX Buffer
//
//*****************************************************************************
uint32_t EUSCI_B_I2C_getTransmitBufferAddress(uint16_t baseAddress)
{
        return baseAddress + OFS_UCBxTXBUF;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for eusci_b_i2c_api
//! @}
//
//*****************************************************************************
